# LinkElementId Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LinkElementId Properties
LinkElementId Class See Also
---
The LinkElementId type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HostElementId | The id of the element in the host, or invalidElementId if there is a link. |
| LinkedElementId | The id of the element in the link, or invalidElementId if no link. |
| LinkInstanceId | The id of the link, or invalidElementId if no link. |

# See Also
LinkElementId Class
Autodesk.Revit.DB Namespace